Revit 2027 API
PipeFittingAndAccessoryData.GetFamilyInstanceId Method
 Gets the Id of the fiting or accessory instance
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetFamilyInstanceId()
Public Function GetFamilyInstanceId As ElementId
public:
ElementId^ GetFamilyInstanceId()
member GetFamilyInstanceId : unit -> ElementId
Return Value
ElementId
 The element Id of the fiting or accessory instance.
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace